#include <iostream>

using namespace std;

// n자리수 정답 = n-1개에서 5 더한거 (나머지0) + n-1개에서 1자리수더한거 (나머지0) [경우의수 2,1,0 *2 해서 6개 다 해보기]
// n-1 자리수 개수 에서 

int main(){
    int dp[1516][3];
    int n;
    cin>>n;
    dp[1][0]=0; //1 5 -> 1 2
    dp[1][1]=1; //2 6 -> 2 0
    dp[1][2]=0; //3 7 -> 0 1 //이게 왜 0인지모르게씀
    for(int i=2;i<=n;i++){
        dp[i][0]=(dp[i-1][1]+dp[i-1][2])%1000000007;
        dp[i][1]=(dp[i-1][0]+dp[i-1][2])%1000000007;
        dp[i][2]=(dp[i-1][0]+dp[i-1][1])%1000000007;
    }
    cout<<dp[n][0];
    return 0;
}

